package com.example.asus.kugoumusic.entity;

/**
 * Created by asus on 2016/9/18.
 */
public class LrcInfo {
    /**
     * code : 0
     * status : success
     * msg : 数据请求成功
     * data : {"content":"[00:22.45]你听远处的声声汽笛\r\n[00:27.51]勾勒出梦境中的岛屿\r\n[00:32.47]在清晨慢上岸的海浪\r\n[00:37.33]是世界尽头的回响\r\n[00:42.40]你看那云上草长莺飞\r\n[00:47.34]绽放着明天红色的花蕊\r\n[00:52.32]成长于苍茫茫的异乡\r\n[00:57.36]回首依然望见故乡月亮\r\n[01:03.91]黑夜给了我黑色眼睛\r\n[01:08.97]我却用它去寻找光明\r\n[01:13.75]汗水凝结成时光胶囊\r\n[01:18.77]独自在这命运里拓荒\r\n[01:23.85]单枪匹马与世界对饮\r\n[01:28.96]历经磨难亦不忘初心\r\n[01:33.73]做自己荣耀的骑士\r\n[01:38.08]勇敢追逐梦想的红日\r\n[02:04.99]你听远处的声声汽笛\r\n[02:10.01]勾勒出梦境中的岛屿\r\n[02:14.91]在清晨慢上岸的海浪\r\n[02:19.91]是世界尽头的回响\r\n[02:25.00]你看那云上草长莺飞\r\n[02:29.88]绽放着明天红色的花蕊\r\n[02:34.74]成长于苍茫茫的异乡\r\n[02:39.93]回首依然望见故乡月亮\r\n[02:46.29]黑夜给了我黑色眼睛\r\n[02:51.34]我却用它去寻找光明\r\n[02:56.35]汗水凝结成时光胶囊\r\n[03:01.37]独自在这命运里拓荒\r\n[03:06.38]单枪匹马与世界对饮\r\n[03:11.23]历经磨难亦不忘初心\r\n[03:16.28]做自己荣耀的骑士\r\n[03:20.43]勇敢追逐梦想的红日\r\n[03:26.35]黑夜给了我黑色眼睛\r\n[03:31.29]我却用它去寻找光明\r\n[03:36.33]汗水凝结成时光胶囊\r\n[03:41.35]独自在这命运里拓荒\r\n[03:46.33]单枪匹马与世界对饮\r\n[03:51.30]历经磨难亦不忘初心\r\n[03:56.23]做自己荣耀的骑士\r\n[04:00.44]勇敢追逐梦想的红日\r\n[04:15.73]勇敢追逐梦想的红日\r\n"}
     */
    private int code;
    private String status;
    private String msg;
    /**
     * content : [00:22.45]你听远处的声声汽笛
     [00:27.51]勾勒出梦境中的岛屿
     [00:32.47]在清晨慢上岸的海浪
     [00:37.33]是世界尽头的回响
     [00:42.40]你看那云上草长莺飞
     [00:47.34]绽放着明天红色的花蕊
     [00:52.32]成长于苍茫茫的异乡
     [00:57.36]回首依然望见故乡月亮
     [01:03.91]黑夜给了我黑色眼睛
     [01:08.97]我却用它去寻找光明
     [01:13.75]汗水凝结成时光胶囊
     [01:18.77]独自在这命运里拓荒
     [01:23.85]单枪匹马与世界对饮
     [01:28.96]历经磨难亦不忘初心
     [01:33.73]做自己荣耀的骑士
     [01:38.08]勇敢追逐梦想的红日
     [02:04.99]你听远处的声声汽笛
     [02:10.01]勾勒出梦境中的岛屿
     [02:14.91]在清晨慢上岸的海浪
     [02:19.91]是世界尽头的回响
     [02:25.00]你看那云上草长莺飞
     [02:29.88]绽放着明天红色的花蕊
     [02:34.74]成长于苍茫茫的异乡
     [02:39.93]回首依然望见故乡月亮
     [02:46.29]黑夜给了我黑色眼睛
     [02:51.34]我却用它去寻找光明
     [02:56.35]汗水凝结成时光胶囊
     [03:01.37]独自在这命运里拓荒
     [03:06.38]单枪匹马与世界对饮
     [03:11.23]历经磨难亦不忘初心
     [03:16.28]做自己荣耀的骑士
     [03:20.43]勇敢追逐梦想的红日
     [03:26.35]黑夜给了我黑色眼睛
     [03:31.29]我却用它去寻找光明
     [03:36.33]汗水凝结成时光胶囊
     [03:41.35]独自在这命运里拓荒
     [03:46.33]单枪匹马与世界对饮
     [03:51.30]历经磨难亦不忘初心
     [03:56.23]做自己荣耀的骑士
     [04:00.44]勇敢追逐梦想的红日
     [04:15.73]勇敢追逐梦想的红日

     */

    private DataBean data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getStatus() {
        return status;
    }

    public void setStatus(String status) {
        this.status = status;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean {
        private String content;

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }
    }
}
